#+STARTUP: hideblocks

#+Title: Tessifs Hive Mind
#+Author: Matze
#+Date: 2020-05-17

*** Basic Example
- C-c C-c to execute
#+BEGIN_SRC python :results output
for i in range(3):
    print(i)
#+END_SRC

#+RESULTS:
: 0
: 1
: 2

*** Solution
1) Change parse.xl_like behaviour so it generates a similar mapping as the others:
   1. Parse the excel spreadsheet into the energy system mapping ('esm'):
      #+BEGIN_SRC python :session parsing :results output
      import pandas as pd
      from tessif.frused.paths import example_dir
      import os
      p = os.path.join(
        example_dir, 'omf', 'xlsx', 'generic_storage.ods')
      esm = pd.read_excel(io=p, sheet_name=None, skiprows=(0, 1, 2), engine='odf')
      
      print(esm['Demand'].loc[
          esm['Demand']['name'] == 'Power Demand']['actual_value'])
      #+END_SRC 

      #+RESULTS:
      : 
      : >>> >>> ... >>> >>> ... 0    1
      : Name: actual_value, dtype: int64

   2. Extract the timeframe dataframe ('timeframe_df') allowing for spelling variatoins:
      #+BEGIN_SRC python :session parsing :results output
      from tessif.frused import spellings
      tf_key = [variant for variant in spellings.timeframe
          if variant in esm.keys()][0]

      timeframe_df = esm.pop(tf_key)
      print(timeframe_df)
      #+END_SRC

      #+RESULTS:
      : 
      : ... >>> >>> >>>                      primary                  secondary  Power Demand.actual_value
      : 0 2016-01-01 00:00:00.000000 2017-01-01 00:00:00.000000                        1.0
      : 1 2016-01-01 01:00:00.000003 2017-01-01 00:59:59.999999                        1.0
      : 2 2016-01-01 01:59:59.999997 2017-01-01 01:59:59.999999                        0.7
      : 3 2016-01-01 03:00:00.000000 2017-01-01 02:59:59.999998                        1.0
      : 4 2016-01-01 03:59:59.999994 2017-01-01 03:59:59.999998                        1.0

   3. Iterate through each timeseries requestment and compare it to each
      component of each component type to fill in the apropriate series
      - Transform 'timeframe'-sheet[{name}{timeseries_seperator}{parameter} to
      - esm[component_type][component_name]['timeseries'] = {parameter: series}
      - esm[component_type][component_name]['timeseries'] to 'None'

      #+BEGIN_SRC python :session parsing :results output
      from tessif.frused import configurations
      from tessif.frused.defaults import energy_system_nodes as esn

      for column_header in timeframe_df.columns:
      for component_type, components_df in esm.copy().items():
      # default timeseries 
      if component_type not in spellings.timeframe:
      components_df['timeseries'] = esn['timeseries']
      for row, component in components_df.iterrows():
      component_name = spellings.get_from(
      component, smth_like='name', dflt=esn['name'])
      if column_header.split(configurations.timeseries_seperator)[
      0] == component_name:
      # yes there is so create a timeseries mapping:
      # value to replace (min/max/actual)
      represented_value = column_header.split(
      configurations.timeseries_seperator)[1]
      series = list(timeframe_df[column_header])
      esm[component_type].loc[
      esm[component_type]['name']==component_name,
      'timeseries'] = {str(represented_value): series}

      print('\n', esm['Demand']['timeseries'])
      #+END_SRC
      
      #+RESULTS:
      : 
      : >>> >>> ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... >>> 
      :  0    {'actual_value': [1.0, 1.0, 0.7, 1.0, 1.0]}
      : Name: timeseries, dtype: object

   4. Check the results
      #+BEGIN_SRC python :session parsing :results output
      print(esm['Demand'].loc[
          esm['Demand']['name'] == 'Power Demand', 'timeseries'])
      #+END_SRC

      #+RESULTS:
      : 
      : 0    {'actual_value': [1.0, 1.0, 0.7, 1.0, 1.0]}
      : Name: timeseries, dtype: object

2) Change file:tessif/transform/mapping2es/omf.py 's parse_timeseries function:

   1. Silence the debugger for a second
      #+begin_src python :session transforming1
      from tessif.frused import configurations
      configurationttpuus.spellings_logging_level = 'debug'
      #+end_src

      #+RESULTS:

   2. Parse the excel spreadsheet into the energy system mapping (esm)
      #+BEGIN_SRC python :session transforming1 :results output
      import pandas as pd
      from tessif.frused.paths import example_dir
      import tessif.parse as parse
      import os
      p = os.path.join(
          example_dir, 'omf', 'xlsx', 'generic_storage.ods')
      esm = parse.xl_like(
          io=os.path.join(
              example_dir, 'omf', 'xlsx', 'generic_storage.ods'),
          engine='odf')
      es_object=esm['Demand'].loc[
          esm['Demand']['name'] == 'Power Demand'].squeeze()
      print()
      print(es_object)
      #+END_SRC 

      #+RESULTS:
      #+begin_example

      >>> >>> >>> ... >>> ... ... ... >>> ... >>>
      name                                                Power Demand
      sector                                                      Heat
      latitude                                                 53.4602
      longitude                                                9.96842
      region                                                   Germany
      active                                                         1
      connection_in                                         Power Grid
      carrier                                              Electricity
      ideal                                                          0
      nominal_value                                                200
      variable_costs                                                 0
      min                                                            1
      max                                                            1
      positive_gradient                                              1
      negative_gradient                                              1
      timeseries           {'actual_value': [1.0, 1.0, 0.7, 1.0, 1.0]}
      fixed                                                          1
      actual_value                                                   1
      investment                                                     0
      maximum                                                        0
      minimum                                                        0
      ep_costs                                                       0
      existing                                                       0
      nonconvex                                                      0
      startup_costs                                                  0
      shutdown_costs                                                 0
      minimum_uptime                                                 1
      minimum_downtime                                               1
      initial_status                                                 1
      Name: 0, dtype: object
#+end_example

   3. Parse the timeseries correctly
      #+begin_src python :session transforming1 :results output
      import tessif.transform.mapping2es.omf
      
      def pt(component):         
         return component['timeseries']

      omf.parse_timeseries = pt
      parsed_timeseries = omf.parse_timeseries(
          component=es_object)
      print()
      print(parsed_timeseries)
      #+end_src

      #+RESULTS:
      : 
      : >>> ... ... >>> >>> ... >>>
      : {'actual_value': [1.0, 1.0, 0.7, 1.0, 1.0]}

*** Verification
1) Parsing the excel spreadsheet correctly:

   #+BEGIN_SRC python :results output
   from tessif import parse
   from tessif.frused.paths import example_dir
   import os

   esm = parse.xl_like(
       io=os.path.join(
           example_dir, 'omf', 'xlsx', 'generic_storage.ods'),
       engine='odf')

   print('actual_value:' , esm['Demand']['actual_value'].iloc[0], '\n')
   print('timeseries:\n', esm['Demand']['timeseries'])
   #+END_SRC

   #+RESULTS:
   #+begin_example
                      timeindex
   0 2016-01-01 00:00:00.000000
   1 2016-01-01 01:00:00.000003
   2 2016-01-01 01:59:59.999997
   3 2016-01-01 03:00:00.000000
   4 2016-01-01 03:59:59.999994
   actual_value: 1 

   timeseries:
    0    {'actual_value': [1.0, 1.0, 0.7, 1.0, 1.0]}
   Name: timeseries, dtype: object
   #+end_example

   Result must be:
   : actual_value: 1 
   : 
   : timeseries:
   :  0    {'actual_value': [1.0, 1.0, 0.7, 1.0, 1.0]}
   : Name: timeseries, dtype: object

2) Transform the mapping correctly:
   #+BEGIN_SRC python :results output
   from tessif import simulate
   from tessif.transform.es2mapping import omf
   from tessif.frused.paths import example_dir
   from tessif import parse
   import os
   import functools
   es = simulate.omf(
        path=os.path.join(
            example_dir, 'omf', 'xlsx', 'generic_storage.ods'),
        parser=functools.partial(parse.xl_like, sheet_name=None,
                                 engine='odf'),
        solver='glpk'
   )

   print(omf.StorageResultier(es).node_soc['Storage'])
   #+END_SRC

   #+RESULTS:
   : 2016-01-01 00:00:00     49.000000
   : 2016-01-01 01:00:00     97.951000
   : 2016-01-01 02:00:00    205.653049
   : 2016-01-01 03:00:00    254.447396
   : 2016-01-01 04:00:00    303.192949
   : Freq: H, Name: Storage, dtype: float64

   Result must be:
   #+begin_example
   2016-01-01 00:00:00     49.000000
   2016-01-01 01:00:00     97.951000
   2016-01-01 02:00:00    205.653049
   2016-01-01 03:00:00    254.447396
   2016-01-01 04:00:00    303.192949
   Freq: H, Name: Storage, dtype: float64
   #+end_example
